### Creating Pandas DataFrame

In [123]:
import numpy as np
import pandas as pd

In [124]:
my_list = np.array([1, 2, 39, 67, 90])

In [125]:
pd.DataFrame(my_list, columns= ['variable_name'], index=[1, 2, 3, 4, 5])

   variable_name
1              1
2              2
3             39
4             67
5             90

#### Multi dim DataFrame

In [126]:
m = np.arange(1, 10).reshape(3, 3)

In [127]:
pd.DataFrame(m, columns=['Col 1', 'Col 2', 'Col 3'], 
             index= ['Row 1', 'Row 2', 'Row 3'])

       Col 1  Col 2  Col 3
Row 1      1      2      3
Row 2      4      5      6
Row 3      7      8      9

In [128]:
df = pd.DataFrame(m, columns=['Col 1', 'Col 2', 'Col 3'], 
             index= ['Row 1', 'Row 2', 'Row 3'])

In [129]:
type(df)

pandas.core.frame.DataFrame

#### Item operations with Pandas DataFrame

In [130]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [131]:
s1

array([0, 3, 2, 1, 6])

In [132]:
my_dict = {'var1': s1, 'var2': s2, 'var3': s3}

In [133]:
df = pd.DataFrame(my_dict)

In [134]:
df

   var1  var2  var3
0     0     4     2
1     3     3     8
2     2     4     1
3     1     6     6
4     6     6     3

In [135]:
df.drop(0, axis= 0)

   var1  var2  var3
1     3     3     8
2     2     4     1
3     1     6     6
4     6     6     3

In [136]:
df.drop(0, axis=0, inplace=True) # Permanent Drop.

In [137]:
df

   var1  var2  var3
1     3     3     8
2     2     4     1
3     1     6     6
4     6     6     3

In [138]:
df.drop('var1', axis=1, inplace=True) # Permanent Drop on column.

In [139]:
df.index = ['a', 'b', 'c', 'd']

In [140]:
df

   var2  var3
a     3     8
b     4     1
c     6     6
d     6     3

In [141]:
df.iloc[2]

var2    6
var3    6
Name: c, dtype: int32

In [142]:
df.loc['a']

var2    3
var3    8
Name: a, dtype: int32

In [143]:
# df.ix[0] Out of date.

In [144]:
l = ['c', 'd']

In [145]:
df.drop(l, axis = 0)

   var2  var3
a     3     8
b     4     1

In [146]:
df2 = pd.DataFrame(my_dict, index=['a', 'b', 'c', 'd', 'e'])

In [147]:
df2

   var1  var2  var3
a     0     4     2
b     3     3     8
c     2     4     1
d     1     6     6
e     6     6     3

In [148]:
'var1' in df2

True

In [149]:
l = ['var1', 'var4', 'var2']

In [150]:
for i in l:
    print(i in df2)

True
False
True

In [165]:
df2

   var1  var2  var3
a     0     4     2
b     3     3     8
c     2     4     1
d     1     6     6
e     1     2     3